theatrus/ksdk/platform/devices/MKV45F15/include/MKV45F15_extension.h
/*! @brief Set the SAMPLE2 field to a new value. */
#define ADC_WR_CLIST1_SAMPLE2(base, value) (ADC_RMW_CLIST1(base, ADC_CLIST1_SAMPLE2_MASK, ADC_CLIST1_SAMPLE2(value)))
#define ADC_BWR_CLIST1_SAMPLE2(base, value) (ADC_WR_CLIST1_SAMPLE2(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST1, field SAMPLE3[15:12] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST1_SAMPLE3 field. */
#define ADC_RD_CLIST1_SAMPLE3(base) ((ADC_CLIST1_REG(base) & ADC_CLIST1_SAMPLE3_MASK) >> ADC_CLIST1_SAMPLE3_SHIFT)
#define ADC_BRD_CLIST1_SAMPLE3(base) (ADC_RD_CLIST1_SAMPLE3(base))

/*! @brief Set the SAMPLE3 field to a new value. */
#define ADC_WR_CLIST1_SAMPLE3(base, value) (ADC_RMW_CLIST1(base, ADC_CLIST1_SAMPLE3_MASK, ADC_CLIST1_SAMPLE3(value)))
#define ADC_BWR_CLIST1_SAMPLE3(base, value) (ADC_WR_CLIST1_SAMPLE3(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLIST2 - ADC Channel List Register 2
 ******************************************************************************/

/*!
 * @brief ADC_CLIST2 - ADC Channel List Register 2 (RW)
 *
 * Reset value: 0x7654U
 */
/*!
 * @name Constants and macros for entire ADC_CLIST2 register
 */
/*@{*/
#define ADC_RD_CLIST2(base)      (ADC_CLIST2_REG(base))
#define ADC_WR_CLIST2(base, value) (ADC_CLIST2_REG(base) = (value))
#define ADC_RMW_CLIST2(base, mask, value) (ADC_WR_CLIST2(base, (ADC_RD_CLIST2(base) & ~(mask)) | (value)))
#define ADC_SET_CLIST2(base, value) (ADC_WR_CLIST2(base, ADC_RD_CLIST2(base) |  (value)))
#define ADC_CLR_CLIST2(base, value) (ADC_WR_CLIST2(base, ADC_RD_CLIST2(base) & ~(value)))
#define ADC_TOG_CLIST2(base, value) (ADC_WR_CLIST2(base, ADC_RD_CLIST2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLIST2 bitfields
 */

/*!
 * @name Register ADC_CLIST2, field SAMPLE4[3:0] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST2_SAMPLE4 field. */
#define ADC_RD_CLIST2_SAMPLE4(base) ((ADC_CLIST2_REG(base) & ADC_CLIST2_SAMPLE4_MASK) >> ADC_CLIST2_SAMPLE4_SHIFT)
#define ADC_BRD_CLIST2_SAMPLE4(base) (ADC_RD_CLIST2_SAMPLE4(base))

/*! @brief Set the SAMPLE4 field to a new value. */
#define ADC_WR_CLIST2_SAMPLE4(base, value) (ADC_RMW_CLIST2(base, ADC_CLIST2_SAMPLE4_MASK, ADC_CLIST2_SAMPLE4(value)))
#define ADC_BWR_CLIST2_SAMPLE4(base, value) (ADC_WR_CLIST2_SAMPLE4(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST2, field SAMPLE5[7:4] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST2_SAMPLE5 field. */
#define ADC_RD_CLIST2_SAMPLE5(base) ((ADC_CLIST2_REG(base) & ADC_CLIST2_SAMPLE5_MASK) >> ADC_CLIST2_SAMPLE5_SHIFT)
#define ADC_BRD_CLIST2_SAMPLE5(base) (ADC_RD_CLIST2_SAMPLE5(base))

/*! @brief Set the SAMPLE5 field to a new value. */
#define ADC_WR_CLIST2_SAMPLE5(base, value) (ADC_RMW_CLIST2(base, ADC_CLIST2_SAMPLE5_MASK, ADC_CLIST2_SAMPLE5(value)))
#define ADC_BWR_CLIST2_SAMPLE5(base, value) (ADC_WR_CLIST2_SAMPLE5(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST2, field SAMPLE6[11:8] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST2_SAMPLE6 field. */
#define ADC_RD_CLIST2_SAMPLE6(base) ((ADC_CLIST2_REG(base) & ADC_CLIST2_SAMPLE6_MASK) >> ADC_CLIST2_SAMPLE6_SHIFT)
#define ADC_BRD_CLIST2_SAMPLE6(base) (ADC_RD_CLIST2_SAMPLE6(base))

/*! @brief Set the SAMPLE6 field to a new value. */
#define ADC_WR_CLIST2_SAMPLE6(base, value) (ADC_RMW_CLIST2(base, ADC_CLIST2_SAMPLE6_MASK, ADC_CLIST2_SAMPLE6(value)))
#define ADC_BWR_CLIST2_SAMPLE6(base, value) (ADC_WR_CLIST2_SAMPLE6(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST2, field SAMPLE7[15:12] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST2_SAMPLE7 field. */
#define ADC_RD_CLIST2_SAMPLE7(base) ((ADC_CLIST2_REG(base) & ADC_CLIST2_SAMPLE7_MASK) >> ADC_CLIST2_SAMPLE7_SHIFT)
#define ADC_BRD_CLIST2_SAMPLE7(base) (ADC_RD_CLIST2_SAMPLE7(base))

/*! @brief Set the SAMPLE7 field to a new value. */
#define ADC_WR_CLIST2_SAMPLE7(base, value) (ADC_RMW_CLIST2(base, ADC_CLIST2_SAMPLE7_MASK, ADC_CLIST2_SAMPLE7(value)))
#define ADC_BWR_CLIST2_SAMPLE7(base, value) (ADC_WR_CLIST2_SAMPLE7(base, value))
/*@}*/

