theatrus/ksdk/platform/devices/MKV45F15/include/MKV45F15_extension.h
/*******************************************************************************
 * PWM_INTEN - Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief PWM_INTEN - Interrupt Enable Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_INTEN register
 */
/*@{*/
#define PWM_RD_INTEN(base, index) (PWM_INTEN_REG(base, index))
#define PWM_WR_INTEN(base, index, value) (PWM_INTEN_REG(base, index) = (value))
#define PWM_RMW_INTEN(base, index, mask, value) (PWM_WR_INTEN(base, index, (PWM_RD_INTEN(base, index) & ~(mask)) | (value)))
#define PWM_SET_INTEN(base, index, value) (PWM_WR_INTEN(base, index, PWM_RD_INTEN(base, index) |  (value)))
#define PWM_CLR_INTEN(base, index, value) (PWM_WR_INTEN(base, index, PWM_RD_INTEN(base, index) & ~(value)))
#define PWM_TOG_INTEN(base, index, value) (PWM_WR_INTEN(base, index, PWM_RD_INTEN(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_INTEN bitfields
 */

/*!
 * @name Register PWM_INTEN, field CMPIE[5:0] (RW)
 *
 * These bits enable the STS[CMPF] flags to cause a compare interrupt request to
 * the CPU.
 *
 * Values:
 * - 0 - The corresponding STS[CMPF] bit will not cause an interrupt request.
 * - 1 - The corresponding STS[CMPF] bit will cause an interrupt request.
 */
/*@{*/
/*! @brief Read current value of the PWM_INTEN_CMPIE field. */
#define PWM_RD_INTEN_CMPIE(base, index) ((PWM_INTEN_REG(base, index) & PWM_INTEN_CMPIE_MASK) >> PWM_INTEN_CMPIE_SHIFT)
#define PWM_BRD_INTEN_CMPIE(base, index) (PWM_RD_INTEN_CMPIE(base, index))

/*! @brief Set the CMPIE field to a new value. */
#define PWM_WR_INTEN_CMPIE(base, index, value) (PWM_RMW_INTEN(base, index, PWM_INTEN_CMPIE_MASK, PWM_INTEN_CMPIE(value)))
#define PWM_BWR_INTEN_CMPIE(base, index, value) (PWM_WR_INTEN_CMPIE(base, index, value))
/*@}*/

/*!
 * @name Register PWM_INTEN, field CX0IE[6] (RW)
 *
 * This bit allows the STS[CFX0] flag to create an interrupt request to the CPU.
 * Do not set both this bit and DMAEN[CX0DE].
 *
 * Values:
 * - 0 - Interrupt request disabled for STS[CFX0].
 * - 1 - Interrupt request enabled for STS[CFX0].
 */
/*@{*/
/*! @brief Read current value of the PWM_INTEN_CX0IE field. */
#define PWM_RD_INTEN_CX0IE(base, index) ((PWM_INTEN_REG(base, index) & PWM_INTEN_CX0IE_MASK) >> PWM_INTEN_CX0IE_SHIFT)
#define PWM_BRD_INTEN_CX0IE(base, index) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CX0IE_SHIFT))

/*! @brief Set the CX0IE field to a new value. */
#define PWM_WR_INTEN_CX0IE(base, index, value) (PWM_RMW_INTEN(base, index, PWM_INTEN_CX0IE_MASK, PWM_INTEN_CX0IE(value)))
#define PWM_BWR_INTEN_CX0IE(base, index, value) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CX0IE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_INTEN, field CX1IE[7] (RW)
 *
 * This bit allows the STS[CFX1] flag to create an interrupt request to the CPU.
 * Do not set both this bit and DMAEN[CX1DE].
 *
 * Values:
 * - 0 - Interrupt request disabled for STS[CFX1].
 * - 1 - Interrupt request enabled for STS[CFX1].
 */
/*@{*/
/*! @brief Read current value of the PWM_INTEN_CX1IE field. */
#define PWM_RD_INTEN_CX1IE(base, index) ((PWM_INTEN_REG(base, index) & PWM_INTEN_CX1IE_MASK) >> PWM_INTEN_CX1IE_SHIFT)
#define PWM_BRD_INTEN_CX1IE(base, index) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CX1IE_SHIFT))

/*! @brief Set the CX1IE field to a new value. */
#define PWM_WR_INTEN_CX1IE(base, index, value) (PWM_RMW_INTEN(base, index, PWM_INTEN_CX1IE_MASK, PWM_INTEN_CX1IE(value)))
#define PWM_BWR_INTEN_CX1IE(base, index, value) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CX1IE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_INTEN, field CB0IE[8] (RW)
 *
 * This bit allows the STS[CFB0] flag to create an interrupt request to the CPU.
 * Do not set both this bit and DMAEN[CB0DE].
 *
 * Values:
 * - 0 - Interrupt request disabled for STS[CFB0].
 * - 1 - Interrupt request enabled for STS[CFB0].
 */
/*@{*/
/*! @brief Read current value of the PWM_INTEN_CB0IE field. */
#define PWM_RD_INTEN_CB0IE(base, index) ((PWM_INTEN_REG(base, index) & PWM_INTEN_CB0IE_MASK) >> PWM_INTEN_CB0IE_SHIFT)
#define PWM_BRD_INTEN_CB0IE(base, index) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CB0IE_SHIFT))

/*! @brief Set the CB0IE field to a new value. */
#define PWM_WR_INTEN_CB0IE(base, index, value) (PWM_RMW_INTEN(base, index, PWM_INTEN_CB0IE_MASK, PWM_INTEN_CB0IE(value)))
#define PWM_BWR_INTEN_CB0IE(base, index, value) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CB0IE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_INTEN, field CB1IE[9] (RW)
 *
 * This bit allows the STS[CFB1] flag to create an interrupt request to the CPU.
 * Do not set both this bit and DMAEN[CB1DE].
 *
 * Values:
 * - 0 - Interrupt request disabled for STS[CFB1].
 * - 1 - Interrupt request enabled for STS[CFB1].
 */
/*@{*/
/*! @brief Read current value of the PWM_INTEN_CB1IE field. */
#define PWM_RD_INTEN_CB1IE(base, index) ((PWM_INTEN_REG(base, index) & PWM_INTEN_CB1IE_MASK) >> PWM_INTEN_CB1IE_SHIFT)
#define PWM_BRD_INTEN_CB1IE(base, index) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CB1IE_SHIFT))

/*! @brief Set the CB1IE field to a new value. */
#define PWM_WR_INTEN_CB1IE(base, index, value) (PWM_RMW_INTEN(base, index, PWM_INTEN_CB1IE_MASK, PWM_INTEN_CB1IE(value)))
#define PWM_BWR_INTEN_CB1IE(base, index, value) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CB1IE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_INTEN, field CA0IE[10] (RW)
 *
 * This bit allows the STS[CFA0] flag to create an interrupt request to the CPU.
 * Do not set both this bit and DMAEN[CA0DE].
 *
 * Values:
 * - 0 - Interrupt request disabled for STS[CFA0].
 * - 1 - Interrupt request enabled for STS[CFA0].
 */
/*@{*/
/*! @brief Read current value of the PWM_INTEN_CA0IE field. */
#define PWM_RD_INTEN_CA0IE(base, index) ((PWM_INTEN_REG(base, index) & PWM_INTEN_CA0IE_MASK) >> PWM_INTEN_CA0IE_SHIFT)
#define PWM_BRD_INTEN_CA0IE(base, index) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CA0IE_SHIFT))

/*! @brief Set the CA0IE field to a new value. */
#define PWM_WR_INTEN_CA0IE(base, index, value) (PWM_RMW_INTEN(base, index, PWM_INTEN_CA0IE_MASK, PWM_INTEN_CA0IE(value)))
#define PWM_BWR_INTEN_CA0IE(base, index, value) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CA0IE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_INTEN, field CA1IE[11] (RW)
 *
 * This bit allows the STS[CFA1] flag to create an interrupt request to the CPU.
 * Do not set both this bit and DMAEN[CA1DE].
 *
 * Values:
 * - 0 - Interrupt request disabled for STS[CFA1].
 * - 1 - Interrupt request enabled for STS[CFA1].
 */
/*@{*/
/*! @brief Read current value of the PWM_INTEN_CA1IE field. */
#define PWM_RD_INTEN_CA1IE(base, index) ((PWM_INTEN_REG(base, index) & PWM_INTEN_CA1IE_MASK) >> PWM_INTEN_CA1IE_SHIFT)
#define PWM_BRD_INTEN_CA1IE(base, index) (BITBAND_ACCESS16(&PWM_INTEN_REG(base, index), PWM_INTEN_CA1IE_SHIFT))

