theatrus/ksdk/platform/devices/MKV45F15/include/MKV45F15_extension.h
/*! @brief Set the ARMB field to a new value. */
#define PWM_WR_CAPTCTRLB_ARMB(base, index, value) (PWM_RMW_CAPTCTRLB(base, index, PWM_CAPTCTRLB_ARMB_MASK, PWM_CAPTCTRLB_ARMB(value)))
#define PWM_BWR_CAPTCTRLB_ARMB(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_ARMB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field ONESHOTB[1] (RW)
 *
 * This bit selects between free running and one shot mode for the input capture
 * circuitry.
 *
 * Values:
 * - 0 - Free running mode is selected. If both capture circuits are enabled,
 *     then capture circuit 0 is armed first after CAPTCTRLB[ARMB] is set. Once a
 *     capture occurs, capture circuit 0 is disarmed and capture circuit 1 is
 *     armed. After capture circuit 1 performs a capture, it is disarmed and capture
 *     circuit 0 is re-armed. The process continues indefinitely. If only one of
 *     the capture circuits is enabled, then captures continue indefinitely on
 *     the enabled capture circuit.
 * - 1 - One shot mode is selected. If both capture circuits are enabled, then
 *     capture circuit 0 is armed first after CAPTCTRLB[ARMB] is set. Once a
 *     capture occurs, capture circuit 0 is disarmed and capture circuit 1 is armed.
 *     After capture circuit 1 performs a capture, it is disarmed and
 *     CAPTCTRLB[ARMB] is cleared. No further captures will be performed until
 *     CAPTCTRLB[ARMB] is set again. If only one of the capture circuits is enabled, then a
 *     single capture will occur on the enabled capture circuit and CAPTCTRLB[ARMB]
 *     is then cleared.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_ONESHOTB field. */
#define PWM_RD_CAPTCTRLB_ONESHOTB(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_ONESHOTB_MASK) >> PWM_CAPTCTRLB_ONESHOTB_SHIFT)
#define PWM_BRD_CAPTCTRLB_ONESHOTB(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_ONESHOTB_SHIFT))

/*! @brief Set the ONESHOTB field to a new value. */
#define PWM_WR_CAPTCTRLB_ONESHOTB(base, index, value) (PWM_RMW_CAPTCTRLB(base, index, PWM_CAPTCTRLB_ONESHOTB_MASK, PWM_CAPTCTRLB_ONESHOTB(value)))
#define PWM_BWR_CAPTCTRLB_ONESHOTB(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_ONESHOTB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field EDGB0[3:2] (RW)
 *
 * These bits control the input capture 0 circuitry by determining which input
 * edges cause a capture event.
 *
 * Values:
 * - 00 - Disabled
 * - 01 - Capture falling edges
 * - 10 - Capture rising edges
 * - 11 - Capture any edge
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_EDGB0 field. */
#define PWM_RD_CAPTCTRLB_EDGB0(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_EDGB0_MASK) >> PWM_CAPTCTRLB_EDGB0_SHIFT)
#define PWM_BRD_CAPTCTRLB_EDGB0(base, index) (PWM_RD_CAPTCTRLB_EDGB0(base, index))

/*! @brief Set the EDGB0 field to a new value. */
#define PWM_WR_CAPTCTRLB_EDGB0(base, index, value) (PWM_RMW_CAPTCTRLB(base, index, PWM_CAPTCTRLB_EDGB0_MASK, PWM_CAPTCTRLB_EDGB0(value)))
#define PWM_BWR_CAPTCTRLB_EDGB0(base, index, value) (PWM_WR_CAPTCTRLB_EDGB0(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field EDGB1[5:4] (RW)
 *
 * These bits control the input capture 1 circuitry by determining which input
 * edges cause a capture event.
 *
 * Values:
 * - 00 - Disabled
 * - 01 - Capture falling edges
 * - 10 - Capture rising edges
 * - 11 - Capture any edge
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_EDGB1 field. */
#define PWM_RD_CAPTCTRLB_EDGB1(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_EDGB1_MASK) >> PWM_CAPTCTRLB_EDGB1_SHIFT)
#define PWM_BRD_CAPTCTRLB_EDGB1(base, index) (PWM_RD_CAPTCTRLB_EDGB1(base, index))

/*! @brief Set the EDGB1 field to a new value. */
#define PWM_WR_CAPTCTRLB_EDGB1(base, index, value) (PWM_RMW_CAPTCTRLB(base, index, PWM_CAPTCTRLB_EDGB1_MASK, PWM_CAPTCTRLB_EDGB1(value)))
#define PWM_BWR_CAPTCTRLB_EDGB1(base, index, value) (PWM_WR_CAPTCTRLB_EDGB1(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field INP_SELB[6] (RW)
 *
 * This bit selects between the raw PWM_B input signal and the output of the
 * edge counter/compare circuitry as the source for the input capture circuit.
 *
 * Values:
 * - 0 - Raw PWM_B input signal selected as source.
 * - 1 - Output of edge counter/compare selected as source. When this bitfield
 *     is set to 1, the internal edge counter is enabled and the rising and/or
 *     falling edges specified by the CAPTCTRLB[EDGB0] and CAPTCTRLB[EDGB1] fields
 *     are ignored. The software must still place a value other than 00 in either
 *     or both of the CAPTCTLRB[EDGB0] and/or CAPTCTRLB[EDGB1] fields in order to
 *     enable one or both of the capture registers.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_INP_SELB field. */
#define PWM_RD_CAPTCTRLB_INP_SELB(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_INP_SELB_MASK) >> PWM_CAPTCTRLB_INP_SELB_SHIFT)
#define PWM_BRD_CAPTCTRLB_INP_SELB(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_INP_SELB_SHIFT))

/*! @brief Set the INP_SELB field to a new value. */
#define PWM_WR_CAPTCTRLB_INP_SELB(base, index, value) (PWM_RMW_CAPTCTRLB(base, index, PWM_CAPTCTRLB_INP_SELB_MASK, PWM_CAPTCTRLB_INP_SELB(value)))
#define PWM_BWR_CAPTCTRLB_INP_SELB(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_INP_SELB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field EDGCNTB_EN[7] (RW)
 *
 * This bit enables the edge counter which counts rising and falling edges on
 * the PWM_B input signal.
 *
 * Values:
 * - 0 - Edge counter disabled and held in reset
 * - 1 - Edge counter enabled
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_EDGCNTB_EN field. */
#define PWM_RD_CAPTCTRLB_EDGCNTB_EN(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_EDGCNTB_EN_MASK) >> PWM_CAPTCTRLB_EDGCNTB_EN_SHIFT)
#define PWM_BRD_CAPTCTRLB_EDGCNTB_EN(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_EDGCNTB_EN_SHIFT))

