theatrus/ksdk/platform/devices/MKV45F15/include/MKV45F15_extension.h
/*
 * Constants & macros for individual PWM_OUTEN bitfields
 */

/*!
 * @name Register PWM_OUTEN, field PWMX_EN[3:0] (RW)
 *
 * The four bits of this field enable the PWM_X outputs of submodules 3-0,
 * respectively. These bits should be set to 0 (output disabled) when a PWM_X pin is
 * being used for input capture or deadtime correction.
 *
 * Values:
 * - 0 - PWM_X output disabled.
 * - 1 - PWM_X output enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_OUTEN_PWMX_EN field. */
#define PWM_RD_OUTEN_PWMX_EN(base) ((PWM_OUTEN_REG(base) & PWM_OUTEN_PWMX_EN_MASK) >> PWM_OUTEN_PWMX_EN_SHIFT)
#define PWM_BRD_OUTEN_PWMX_EN(base) (PWM_RD_OUTEN_PWMX_EN(base))

/*! @brief Set the PWMX_EN field to a new value. */
#define PWM_WR_OUTEN_PWMX_EN(base, value) (PWM_RMW_OUTEN(base, PWM_OUTEN_PWMX_EN_MASK, PWM_OUTEN_PWMX_EN(value)))
#define PWM_BWR_OUTEN_PWMX_EN(base, value) (PWM_WR_OUTEN_PWMX_EN(base, value))
/*@}*/

/*!
 * @name Register PWM_OUTEN, field PWMB_EN[7:4] (RW)
 *
 * The four bits of this field enable the PWM_B outputs of submodules 3-0,
 * respectively. These bits should be set to 0 (output disabled) when a PWM_B pin is
 * being used for input capture.
 *
 * Values:
 * - 0 - PWM_B output disabled.
 * - 1 - PWM_B output enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_OUTEN_PWMB_EN field. */
#define PWM_RD_OUTEN_PWMB_EN(base) ((PWM_OUTEN_REG(base) & PWM_OUTEN_PWMB_EN_MASK) >> PWM_OUTEN_PWMB_EN_SHIFT)
#define PWM_BRD_OUTEN_PWMB_EN(base) (PWM_RD_OUTEN_PWMB_EN(base))

/*! @brief Set the PWMB_EN field to a new value. */
#define PWM_WR_OUTEN_PWMB_EN(base, value) (PWM_RMW_OUTEN(base, PWM_OUTEN_PWMB_EN_MASK, PWM_OUTEN_PWMB_EN(value)))
#define PWM_BWR_OUTEN_PWMB_EN(base, value) (PWM_WR_OUTEN_PWMB_EN(base, value))
/*@}*/

/*!
 * @name Register PWM_OUTEN, field PWMA_EN[11:8] (RW)
 *
 * The four bits of this field enable the PWM_A outputs of submodules 3-0,
 * respectively. These bits should be set to 0 (output disabled) when a PWM_A pin is
 * being used for input capture.
 *
 * Values:
 * - 0 - PWM_A output disabled.
 * - 1 - PWM_A output enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_OUTEN_PWMA_EN field. */
#define PWM_RD_OUTEN_PWMA_EN(base) ((PWM_OUTEN_REG(base) & PWM_OUTEN_PWMA_EN_MASK) >> PWM_OUTEN_PWMA_EN_SHIFT)
#define PWM_BRD_OUTEN_PWMA_EN(base) (PWM_RD_OUTEN_PWMA_EN(base))

/*! @brief Set the PWMA_EN field to a new value. */
#define PWM_WR_OUTEN_PWMA_EN(base, value) (PWM_RMW_OUTEN(base, PWM_OUTEN_PWMA_EN_MASK, PWM_OUTEN_PWMA_EN(value)))
#define PWM_BWR_OUTEN_PWMA_EN(base, value) (PWM_WR_OUTEN_PWMA_EN(base, value))
/*@}*/

/*******************************************************************************
 * PWM_MASK - Mask Register
 ******************************************************************************/

/*!
 * @brief PWM_MASK - Mask Register (RW)
 *
 * Reset value: 0x0000U
 *
 * MASK is double buffered and does not take effect until a FORCE_OUT event
 * occurs within the appropriate submodule. Reading MASK reads the buffered values
 * and not necessarily the values currently in effect. This double buffering can be
 * overridden by setting the UPDATE_MASK bits.
 */
/*!
 * @name Constants and macros for entire PWM_MASK register
 */
/*@{*/
#define PWM_RD_MASK(base)        (PWM_MASK_REG(base))
#define PWM_WR_MASK(base, value) (PWM_MASK_REG(base) = (value))
#define PWM_RMW_MASK(base, mask, value) (PWM_WR_MASK(base, (PWM_RD_MASK(base) & ~(mask)) | (value)))
#define PWM_SET_MASK(base, value) (PWM_WR_MASK(base, PWM_RD_MASK(base) |  (value)))
#define PWM_CLR_MASK(base, value) (PWM_WR_MASK(base, PWM_RD_MASK(base) & ~(value)))
#define PWM_TOG_MASK(base, value) (PWM_WR_MASK(base, PWM_RD_MASK(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_MASK bitfields
 */

/*!
 * @name Register PWM_MASK, field MASKX[3:0] (RW)
 *
 * The four bits of this field mask the PWM_X outputs of submodules 3-0,
 * respectively, forcing the output to logic 0 prior to consideration of the output
 * polarity.
 *
 * Values:
 * - 0 - PWM_X output normal.
 * - 1 - PWM_X output masked.
 */
/*@{*/
/*! @brief Read current value of the PWM_MASK_MASKX field. */
#define PWM_RD_MASK_MASKX(base) ((PWM_MASK_REG(base) & PWM_MASK_MASKX_MASK) >> PWM_MASK_MASKX_SHIFT)
#define PWM_BRD_MASK_MASKX(base) (PWM_RD_MASK_MASKX(base))

/*! @brief Set the MASKX field to a new value. */
#define PWM_WR_MASK_MASKX(base, value) (PWM_RMW_MASK(base, PWM_MASK_MASKX_MASK, PWM_MASK_MASKX(value)))
#define PWM_BWR_MASK_MASKX(base, value) (PWM_WR_MASK_MASKX(base, value))
/*@}*/

/*!
 * @name Register PWM_MASK, field MASKB[7:4] (RW)
 *
 * The four bits of this field mask the PWM_B outputs of submodules 3-0,
 * respectively, forcing the output to logic 0 prior to consideration of the output
 * polarity.
 *
 * Values:
 * - 0 - PWM_B output normal.
 * - 1 - PWM_B output masked.
 */
/*@{*/
/*! @brief Read current value of the PWM_MASK_MASKB field. */
#define PWM_RD_MASK_MASKB(base) ((PWM_MASK_REG(base) & PWM_MASK_MASKB_MASK) >> PWM_MASK_MASKB_SHIFT)
#define PWM_BRD_MASK_MASKB(base) (PWM_RD_MASK_MASKB(base))

/*! @brief Set the MASKB field to a new value. */
#define PWM_WR_MASK_MASKB(base, value) (PWM_RMW_MASK(base, PWM_MASK_MASKB_MASK, PWM_MASK_MASKB(value)))
#define PWM_BWR_MASK_MASKB(base, value) (PWM_WR_MASK_MASKB(base, value))
/*@}*/

/*!
 * @name Register PWM_MASK, field MASKA[11:8] (RW)
 *
 * The four bits of this field mask the PWM_A outputs of submodules 3-0,
 * respectively, forcing the output to logic 0 prior to consideration of the output
 * polarity.
 *
 * Values:
 * - 0 - PWM_A output normal.
 * - 1 - PWM_A output masked.
 */
/*@{*/
/*! @brief Read current value of the PWM_MASK_MASKA field. */
#define PWM_RD_MASK_MASKA(base) ((PWM_MASK_REG(base) & PWM_MASK_MASKA_MASK) >> PWM_MASK_MASKA_SHIFT)
#define PWM_BRD_MASK_MASKA(base) (PWM_RD_MASK_MASKA(base))

/*! @brief Set the MASKA field to a new value. */
#define PWM_WR_MASK_MASKA(base, value) (PWM_RMW_MASK(base, PWM_MASK_MASKA_MASK, PWM_MASK_MASKA(value)))
#define PWM_BWR_MASK_MASKA(base, value) (PWM_WR_MASK_MASKA(base, value))
/*@}*/

/*!
 * @name Register PWM_MASK, field UPDATE_MASK[15:12] (WO)
 *
 * The four bits mask the PWM_X outputs of submodules 3-0, respectively, The
 * four bits of this field force the MASK* bits to be immediately updated within
 * submodules 3-0, respectively, without waiting for a FORCE_OUT event. These
 * self-clearing bits always read as zero. Software may write to any or all of these
 * bits and may set these bits in the same write operation that updates the MASKA,
 * MASKB, and MASKX fields of this register.
 *
 * Values:
 * - 0 - Normal operation. MASK* bits within the corresponding submodule are not
 *     updated until a FORCE_OUT event occurs within the submodule.
 * - 1 - Immediate operation. MASK* bits within the corresponding submodule are
 *     updated on the following clock edge after setting this bit.
 */
/*@{*/
/*! @brief Set the UPDATE_MASK field to a new value. */
#define PWM_WR_MASK_UPDATE_MASK(base, value) (PWM_RMW_MASK(base, PWM_MASK_UPDATE_MASK_MASK, PWM_MASK_UPDATE_MASK(value)))
#define PWM_BWR_MASK_UPDATE_MASK(base, value) (PWM_WR_MASK_UPDATE_MASK(base, value))
/*@}*/

