theatrus/ksdk/platform/devices/MKV45F15/include/MKV45F15_extension.h
/*! @brief Set the SM2SEL45 field to a new value. */
#define PWM_WR_DTSRCSEL_SM2SEL45(base, value) (PWM_RMW_DTSRCSEL(base, PWM_DTSRCSEL_SM2SEL45_MASK, PWM_DTSRCSEL_SM2SEL45(value)))
#define PWM_BWR_DTSRCSEL_SM2SEL45(base, value) (PWM_WR_DTSRCSEL_SM2SEL45(base, value))
/*@}*/

/*!
 * @name Register PWM_DTSRCSEL, field SM2SEL23[11:10] (RW)
 *
 * This field selects possible over-rides to the generated SM2PWM23 signal that
 * will be passed to the deadtime logic upon the occurrence of a FORCE_OUT event
 * in that submodule.
 *
 * Values:
 * - 00 - Generated SM2PWM23 signal is used by the deadtime logic.
 * - 01 - Inverted generated SM2PWM23 signal is used by the deadtime logic.
 * - 10 - SWCOUT[SM2OUT23] is used by the deadtime logic.
 * - 11 - PWM2_EXTA signal is used by the deadtime logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_DTSRCSEL_SM2SEL23 field. */
#define PWM_RD_DTSRCSEL_SM2SEL23(base) ((PWM_DTSRCSEL_REG(base) & PWM_DTSRCSEL_SM2SEL23_MASK) >> PWM_DTSRCSEL_SM2SEL23_SHIFT)
#define PWM_BRD_DTSRCSEL_SM2SEL23(base) (PWM_RD_DTSRCSEL_SM2SEL23(base))

/*! @brief Set the SM2SEL23 field to a new value. */
#define PWM_WR_DTSRCSEL_SM2SEL23(base, value) (PWM_RMW_DTSRCSEL(base, PWM_DTSRCSEL_SM2SEL23_MASK, PWM_DTSRCSEL_SM2SEL23(value)))
#define PWM_BWR_DTSRCSEL_SM2SEL23(base, value) (PWM_WR_DTSRCSEL_SM2SEL23(base, value))
/*@}*/

/*!
 * @name Register PWM_DTSRCSEL, field SM3SEL45[13:12] (RW)
 *
 * This field selects possible over-rides to the generated SM3PWM45 signal that
 * will be passed to the deadtime logic upon the occurrence of a FORCE_OUT event
 * in that submodule.
 *
 * Values:
 * - 00 - Generated SM3PWM45 signal is used by the deadtime logic.
 * - 01 - Inverted generated SM3PWM45 signal is used by the deadtime logic.
 * - 10 - SWCOUT[SM3OUT45] is used by the deadtime logic.
 * - 11 - PWM3_EXTB signal is used by the deadtime logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_DTSRCSEL_SM3SEL45 field. */
#define PWM_RD_DTSRCSEL_SM3SEL45(base) ((PWM_DTSRCSEL_REG(base) & PWM_DTSRCSEL_SM3SEL45_MASK) >> PWM_DTSRCSEL_SM3SEL45_SHIFT)
#define PWM_BRD_DTSRCSEL_SM3SEL45(base) (PWM_RD_DTSRCSEL_SM3SEL45(base))

/*! @brief Set the SM3SEL45 field to a new value. */
#define PWM_WR_DTSRCSEL_SM3SEL45(base, value) (PWM_RMW_DTSRCSEL(base, PWM_DTSRCSEL_SM3SEL45_MASK, PWM_DTSRCSEL_SM3SEL45(value)))
#define PWM_BWR_DTSRCSEL_SM3SEL45(base, value) (PWM_WR_DTSRCSEL_SM3SEL45(base, value))
/*@}*/

/*!
 * @name Register PWM_DTSRCSEL, field SM3SEL23[15:14] (RW)
 *
 * This field selects possible over-rides to the generated SM3PWM23 signal that
 * will be passed to the deadtime logic upon the occurrence of a FORCE_OUT event
 * in that submodule.
 *
 * Values:
 * - 00 - Generated SM3PWM23 signal is used by the deadtime logic.
 * - 01 - Inverted generated SM3PWM23 signal is used by the deadtime logic.
 * - 10 - SWCOUT[SM3OUT23] is used by the deadtime logic.
 * - 11 - PWM3_EXTA signal is used by the deadtime logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_DTSRCSEL_SM3SEL23 field. */
#define PWM_RD_DTSRCSEL_SM3SEL23(base) ((PWM_DTSRCSEL_REG(base) & PWM_DTSRCSEL_SM3SEL23_MASK) >> PWM_DTSRCSEL_SM3SEL23_SHIFT)
#define PWM_BRD_DTSRCSEL_SM3SEL23(base) (PWM_RD_DTSRCSEL_SM3SEL23(base))

/*! @brief Set the SM3SEL23 field to a new value. */
#define PWM_WR_DTSRCSEL_SM3SEL23(base, value) (PWM_RMW_DTSRCSEL(base, PWM_DTSRCSEL_SM3SEL23_MASK, PWM_DTSRCSEL_SM3SEL23(value)))
#define PWM_BWR_DTSRCSEL_SM3SEL23(base, value) (PWM_WR_DTSRCSEL_SM3SEL23(base, value))
/*@}*/

/*******************************************************************************
 * PWM_MCTRL - Master Control Register
 ******************************************************************************/

/*!
 * @brief PWM_MCTRL - Master Control Register (RW)
 *
 * Reset value: 0x0000U
 *
 * In every 4-bit field in this register, each bit acts on a separate submodule.
 * Accordingly, the description of every bitfield refers to the effect of an
 * individual bit.
 */
/*!
 * @name Constants and macros for entire PWM_MCTRL register
 */
/*@{*/
#define PWM_RD_MCTRL(base)       (PWM_MCTRL_REG(base))
#define PWM_WR_MCTRL(base, value) (PWM_MCTRL_REG(base) = (value))
#define PWM_RMW_MCTRL(base, mask, value) (PWM_WR_MCTRL(base, (PWM_RD_MCTRL(base) & ~(mask)) | (value)))
#define PWM_SET_MCTRL(base, value) (PWM_WR_MCTRL(base, PWM_RD_MCTRL(base) |  (value)))
#define PWM_CLR_MCTRL(base, value) (PWM_WR_MCTRL(base, PWM_RD_MCTRL(base) & ~(value)))
#define PWM_TOG_MCTRL(base, value) (PWM_WR_MCTRL(base, PWM_RD_MCTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_MCTRL bitfields
 */

/*!
 * @name Register PWM_MCTRL, field LDOK[3:0] (RW)
 *
 * The 4 bits of LDOK field correspond to submodules 3-0, respectively. Each
 * read/set bit loads CTRL[PRSC] and the INIT, FRACVALx, and VALx registers of the
 * corresponding submodule into a set of buffers. The buffered prescaler divisor,
 * submodule counter modulus value, and PWM pulse width take effect at the next
 * PWM reload if CTRL[LDMOD] is clear or immediately if CTRL[LDMOD] is set. Set
 * the corresponding MCTRL[LDOK] bit by reading it when it is logic zero and then
 * writing a logic one to it. The VALx, FRACVALx,INIT, and CTRL[PRSC] registers of
 * the corresponding submodule cannot be written while the the corresponding
 * MCTRL[LDOK] bit is set. In Master Reload Mode (CTRL2[RELOAD_SEL]=1), it is only
 * necessary to set the LDOK bit corresponding to submodule0; however, it is
 * recommended to also set the LDOK bit of the slave submodules, to prevent unwanted
 * writes to the registers in the slave submodules. The MCTRL[LDOK] bit is
 * automatically cleared after the new values are loaded, or it can be manually cleared
 * before a reload by writing a logic 1 to the appropriate MCTRL[CLDOK] bit. LDOK
 * bits cannot be written with a zero. MCTRL[LDOK] can be set in DMA mode when
 * the DMA indicates that it has completed the update of all CTRL[PRSC],
 * INIT,FRACVALx, and VALx registers in the corresponding submodule. Reset clears LDOK
 * field.
 *
 * Values:
 * - 0 - Do not load new values.
 * - 1 - Load prescaler, modulus, and PWM values of the corresponding submodule.
 */
/*@{*/
/*! @brief Read current value of the PWM_MCTRL_LDOK field. */
#define PWM_RD_MCTRL_LDOK(base) ((PWM_MCTRL_REG(base) & PWM_MCTRL_LDOK_MASK) >> PWM_MCTRL_LDOK_SHIFT)
#define PWM_BRD_MCTRL_LDOK(base) (PWM_RD_MCTRL_LDOK(base))

