theatrus/ksdk/platform/devices/MKV45F15/include/MKV45F15_extension.h
/*******************************************************************************
 * XBARA_SEL22 - Crossbar A Select Register 22
 ******************************************************************************/

/*!
 * @brief XBARA_SEL22 - Crossbar A Select Register 22 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL22 register
 */
/*@{*/
#define XBARA_RD_SEL22(base)     (XBARA_SEL22_REG(base))
#define XBARA_WR_SEL22(base, value) (XBARA_SEL22_REG(base) = (value))
#define XBARA_RMW_SEL22(base, mask, value) (XBARA_WR_SEL22(base, (XBARA_RD_SEL22(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL22(base, value) (XBARA_WR_SEL22(base, XBARA_RD_SEL22(base) |  (value)))
#define XBARA_CLR_SEL22(base, value) (XBARA_WR_SEL22(base, XBARA_RD_SEL22(base) & ~(value)))
#define XBARA_TOG_SEL22(base, value) (XBARA_WR_SEL22(base, XBARA_RD_SEL22(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL22 bitfields
 */

/*!
 * @name Register XBARA_SEL22, field SEL44[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT44 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL22_SEL44 field. */
#define XBARA_RD_SEL22_SEL44(base) ((XBARA_SEL22_REG(base) & XBARA_SEL22_SEL44_MASK) >> XBARA_SEL22_SEL44_SHIFT)
#define XBARA_BRD_SEL22_SEL44(base) (XBARA_RD_SEL22_SEL44(base))

/*! @brief Set the SEL44 field to a new value. */
#define XBARA_WR_SEL22_SEL44(base, value) (XBARA_RMW_SEL22(base, XBARA_SEL22_SEL44_MASK, XBARA_SEL22_SEL44(value)))
#define XBARA_BWR_SEL22_SEL44(base, value) (XBARA_WR_SEL22_SEL44(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL22, field SEL45[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT45 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL22_SEL45 field. */
#define XBARA_RD_SEL22_SEL45(base) ((XBARA_SEL22_REG(base) & XBARA_SEL22_SEL45_MASK) >> XBARA_SEL22_SEL45_SHIFT)
#define XBARA_BRD_SEL22_SEL45(base) (XBARA_RD_SEL22_SEL45(base))

/*! @brief Set the SEL45 field to a new value. */
#define XBARA_WR_SEL22_SEL45(base, value) (XBARA_RMW_SEL22(base, XBARA_SEL22_SEL45_MASK, XBARA_SEL22_SEL45(value)))
#define XBARA_BWR_SEL22_SEL45(base, value) (XBARA_WR_SEL22_SEL45(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL23 - Crossbar A Select Register 23
 ******************************************************************************/

/*!
 * @brief XBARA_SEL23 - Crossbar A Select Register 23 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL23 register
 */
/*@{*/
#define XBARA_RD_SEL23(base)     (XBARA_SEL23_REG(base))
#define XBARA_WR_SEL23(base, value) (XBARA_SEL23_REG(base) = (value))
#define XBARA_RMW_SEL23(base, mask, value) (XBARA_WR_SEL23(base, (XBARA_RD_SEL23(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL23(base, value) (XBARA_WR_SEL23(base, XBARA_RD_SEL23(base) |  (value)))
#define XBARA_CLR_SEL23(base, value) (XBARA_WR_SEL23(base, XBARA_RD_SEL23(base) & ~(value)))
#define XBARA_TOG_SEL23(base, value) (XBARA_WR_SEL23(base, XBARA_RD_SEL23(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL23 bitfields
 */

/*!
 * @name Register XBARA_SEL23, field SEL46[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT46 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL23_SEL46 field. */
#define XBARA_RD_SEL23_SEL46(base) ((XBARA_SEL23_REG(base) & XBARA_SEL23_SEL46_MASK) >> XBARA_SEL23_SEL46_SHIFT)
#define XBARA_BRD_SEL23_SEL46(base) (XBARA_RD_SEL23_SEL46(base))

/*! @brief Set the SEL46 field to a new value. */
#define XBARA_WR_SEL23_SEL46(base, value) (XBARA_RMW_SEL23(base, XBARA_SEL23_SEL46_MASK, XBARA_SEL23_SEL46(value)))
#define XBARA_BWR_SEL23_SEL46(base, value) (XBARA_WR_SEL23_SEL46(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL23, field SEL47[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT47 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL23_SEL47 field. */
#define XBARA_RD_SEL23_SEL47(base) ((XBARA_SEL23_REG(base) & XBARA_SEL23_SEL47_MASK) >> XBARA_SEL23_SEL47_SHIFT)
#define XBARA_BRD_SEL23_SEL47(base) (XBARA_RD_SEL23_SEL47(base))

/*! @brief Set the SEL47 field to a new value. */
#define XBARA_WR_SEL23_SEL47(base, value) (XBARA_RMW_SEL23(base, XBARA_SEL23_SEL47_MASK, XBARA_SEL23_SEL47(value)))
#define XBARA_BWR_SEL23_SEL47(base, value) (XBARA_WR_SEL23_SEL47(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL24 - Crossbar A Select Register 24
 ******************************************************************************/

/*!
 * @brief XBARA_SEL24 - Crossbar A Select Register 24 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL24 register
 */
/*@{*/
#define XBARA_RD_SEL24(base)     (XBARA_SEL24_REG(base))
#define XBARA_WR_SEL24(base, value) (XBARA_SEL24_REG(base) = (value))
#define XBARA_RMW_SEL24(base, mask, value) (XBARA_WR_SEL24(base, (XBARA_RD_SEL24(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL24(base, value) (XBARA_WR_SEL24(base, XBARA_RD_SEL24(base) |  (value)))
#define XBARA_CLR_SEL24(base, value) (XBARA_WR_SEL24(base, XBARA_RD_SEL24(base) & ~(value)))
#define XBARA_TOG_SEL24(base, value) (XBARA_WR_SEL24(base, XBARA_RD_SEL24(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL24 bitfields
 */

/*!
 * @name Register XBARA_SEL24, field SEL48[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT48 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL24_SEL48 field. */
#define XBARA_RD_SEL24_SEL48(base) ((XBARA_SEL24_REG(base) & XBARA_SEL24_SEL48_MASK) >> XBARA_SEL24_SEL48_SHIFT)
#define XBARA_BRD_SEL24_SEL48(base) (XBARA_RD_SEL24_SEL48(base))

/*! @brief Set the SEL48 field to a new value. */
#define XBARA_WR_SEL24_SEL48(base, value) (XBARA_RMW_SEL24(base, XBARA_SEL24_SEL48_MASK, XBARA_SEL24_SEL48(value)))
#define XBARA_BWR_SEL24_SEL48(base, value) (XBARA_WR_SEL24_SEL48(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL24, field SEL49[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT49 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL24_SEL49 field. */
#define XBARA_RD_SEL24_SEL49(base) ((XBARA_SEL24_REG(base) & XBARA_SEL24_SEL49_MASK) >> XBARA_SEL24_SEL49_SHIFT)
#define XBARA_BRD_SEL24_SEL49(base) (XBARA_RD_SEL24_SEL49(base))

/*! @brief Set the SEL49 field to a new value. */
#define XBARA_WR_SEL24_SEL49(base, value) (XBARA_RMW_SEL24(base, XBARA_SEL24_SEL49_MASK, XBARA_SEL24_SEL49(value)))
#define XBARA_BWR_SEL24_SEL49(base, value) (XBARA_WR_SEL24_SEL49(base, value))
/*@}*/

