theatrus/ksdk/platform/devices/MKV45F15/include/MKV45F15_extension.h
/* Clear the XBARA_CTRLx_STSx field value. */
#define XBARA_CLR_CTRLx_STSx(base, outIndex)      (XBARA_CTRLx((base), (outIndex)) = (XBARA_CTRLx((base), (outIndex)) & ~(1U << (4U + (XBARA_SEL0_SEL1_SHIFT * (((outIndex) + 1U) % 2U))))))

/*
 * MKV45F15 XBARB
 *
 * Crossbar Switch
 *
 * Registers defined in this header file:
 * - XBARB_SEL0 - Crossbar B Select Register 0
 * - XBARB_SEL1 - Crossbar B Select Register 1
 * - XBARB_SEL2 - Crossbar B Select Register 2
 * - XBARB_SEL3 - Crossbar B Select Register 3
 * - XBARB_SEL4 - Crossbar B Select Register 4
 * - XBARB_SEL5 - Crossbar B Select Register 5
 * - XBARB_SEL6 - Crossbar B Select Register 6
 * - XBARB_SEL7 - Crossbar B Select Register 7
 */

#define XBARB_INSTANCE_COUNT (1U) /*!< Number of instances of the XBARB module. */
#define XBARB_IDX (0U) /*!< Instance number for XBARB. */

/*******************************************************************************
 * XBARB_SEL0 - Crossbar B Select Register 0
 ******************************************************************************/

/*!
 * @brief XBARB_SEL0 - Crossbar B Select Register 0 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL0 register
 */
/*@{*/
#define XBARB_RD_SEL0(base)      (XBARB_SEL0_REG(base))
#define XBARB_WR_SEL0(base, value) (XBARB_SEL0_REG(base) = (value))
#define XBARB_RMW_SEL0(base, mask, value) (XBARB_WR_SEL0(base, (XBARB_RD_SEL0(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL0(base, value) (XBARB_WR_SEL0(base, XBARB_RD_SEL0(base) |  (value)))
#define XBARB_CLR_SEL0(base, value) (XBARB_WR_SEL0(base, XBARB_RD_SEL0(base) & ~(value)))
#define XBARB_TOG_SEL0(base, value) (XBARB_WR_SEL0(base, XBARB_RD_SEL0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL0 bitfields
 */

/*!
 * @name Register XBARB_SEL0, field SEL0[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT0 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL0_SEL0 field. */
#define XBARB_RD_SEL0_SEL0(base) ((XBARB_SEL0_REG(base) & XBARB_SEL0_SEL0_MASK) >> XBARB_SEL0_SEL0_SHIFT)
#define XBARB_BRD_SEL0_SEL0(base) (XBARB_RD_SEL0_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define XBARB_WR_SEL0_SEL0(base, value) (XBARB_RMW_SEL0(base, XBARB_SEL0_SEL0_MASK, XBARB_SEL0_SEL0(value)))
#define XBARB_BWR_SEL0_SEL0(base, value) (XBARB_WR_SEL0_SEL0(base, value))
/*@}*/

/*!
 * @name Register XBARB_SEL0, field SEL1[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT1 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL0_SEL1 field. */
#define XBARB_RD_SEL0_SEL1(base) ((XBARB_SEL0_REG(base) & XBARB_SEL0_SEL1_MASK) >> XBARB_SEL0_SEL1_SHIFT)
#define XBARB_BRD_SEL0_SEL1(base) (XBARB_RD_SEL0_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define XBARB_WR_SEL0_SEL1(base, value) (XBARB_RMW_SEL0(base, XBARB_SEL0_SEL1_MASK, XBARB_SEL0_SEL1(value)))
#define XBARB_BWR_SEL0_SEL1(base, value) (XBARB_WR_SEL0_SEL1(base, value))
/*@}*/

/*******************************************************************************
 * XBARB_SEL1 - Crossbar B Select Register 1
 ******************************************************************************/

/*!
 * @brief XBARB_SEL1 - Crossbar B Select Register 1 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL1 register
 */
/*@{*/
#define XBARB_RD_SEL1(base)      (XBARB_SEL1_REG(base))
#define XBARB_WR_SEL1(base, value) (XBARB_SEL1_REG(base) = (value))
#define XBARB_RMW_SEL1(base, mask, value) (XBARB_WR_SEL1(base, (XBARB_RD_SEL1(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL1(base, value) (XBARB_WR_SEL1(base, XBARB_RD_SEL1(base) |  (value)))
#define XBARB_CLR_SEL1(base, value) (XBARB_WR_SEL1(base, XBARB_RD_SEL1(base) & ~(value)))
#define XBARB_TOG_SEL1(base, value) (XBARB_WR_SEL1(base, XBARB_RD_SEL1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL1 bitfields
 */

/*!
 * @name Register XBARB_SEL1, field SEL2[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT2 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL1_SEL2 field. */
#define XBARB_RD_SEL1_SEL2(base) ((XBARB_SEL1_REG(base) & XBARB_SEL1_SEL2_MASK) >> XBARB_SEL1_SEL2_SHIFT)
#define XBARB_BRD_SEL1_SEL2(base) (XBARB_RD_SEL1_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define XBARB_WR_SEL1_SEL2(base, value) (XBARB_RMW_SEL1(base, XBARB_SEL1_SEL2_MASK, XBARB_SEL1_SEL2(value)))
#define XBARB_BWR_SEL1_SEL2(base, value) (XBARB_WR_SEL1_SEL2(base, value))
/*@}*/

/*!
 * @name Register XBARB_SEL1, field SEL3[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT3 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL1_SEL3 field. */
#define XBARB_RD_SEL1_SEL3(base) ((XBARB_SEL1_REG(base) & XBARB_SEL1_SEL3_MASK) >> XBARB_SEL1_SEL3_SHIFT)
#define XBARB_BRD_SEL1_SEL3(base) (XBARB_RD_SEL1_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define XBARB_WR_SEL1_SEL3(base, value) (XBARB_RMW_SEL1(base, XBARB_SEL1_SEL3_MASK, XBARB_SEL1_SEL3(value)))
#define XBARB_BWR_SEL1_SEL3(base, value) (XBARB_WR_SEL1_SEL3(base, value))
/*@}*/

/*******************************************************************************
 * XBARB_SEL2 - Crossbar B Select Register 2
 ******************************************************************************/

/*!
 * @brief XBARB_SEL2 - Crossbar B Select Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL2 register
 */
/*@{*/
#define XBARB_RD_SEL2(base)      (XBARB_SEL2_REG(base))
#define XBARB_WR_SEL2(base, value) (XBARB_SEL2_REG(base) = (value))
#define XBARB_RMW_SEL2(base, mask, value) (XBARB_WR_SEL2(base, (XBARB_RD_SEL2(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL2(base, value) (XBARB_WR_SEL2(base, XBARB_RD_SEL2(base) |  (value)))
#define XBARB_CLR_SEL2(base, value) (XBARB_WR_SEL2(base, XBARB_RD_SEL2(base) & ~(value)))
#define XBARB_TOG_SEL2(base, value) (XBARB_WR_SEL2(base, XBARB_RD_SEL2(base) ^  (value)))
/*@}*/

