theatrus/ksdk/platform/devices/MKV45F15/include/MKV45F15_extension.h
/*
 * Constants & macros for individual XBARB_SEL5 bitfields
 */

/*!
 * @name Register XBARB_SEL5, field SEL10[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT10 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL5_SEL10 field. */
#define XBARB_RD_SEL5_SEL10(base) ((XBARB_SEL5_REG(base) & XBARB_SEL5_SEL10_MASK) >> XBARB_SEL5_SEL10_SHIFT)
#define XBARB_BRD_SEL5_SEL10(base) (XBARB_RD_SEL5_SEL10(base))

/*! @brief Set the SEL10 field to a new value. */
#define XBARB_WR_SEL5_SEL10(base, value) (XBARB_RMW_SEL5(base, XBARB_SEL5_SEL10_MASK, XBARB_SEL5_SEL10(value)))
#define XBARB_BWR_SEL5_SEL10(base, value) (XBARB_WR_SEL5_SEL10(base, value))
/*@}*/

/*!
 * @name Register XBARB_SEL5, field SEL11[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT11 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL5_SEL11 field. */
#define XBARB_RD_SEL5_SEL11(base) ((XBARB_SEL5_REG(base) & XBARB_SEL5_SEL11_MASK) >> XBARB_SEL5_SEL11_SHIFT)
#define XBARB_BRD_SEL5_SEL11(base) (XBARB_RD_SEL5_SEL11(base))

/*! @brief Set the SEL11 field to a new value. */
#define XBARB_WR_SEL5_SEL11(base, value) (XBARB_RMW_SEL5(base, XBARB_SEL5_SEL11_MASK, XBARB_SEL5_SEL11(value)))
#define XBARB_BWR_SEL5_SEL11(base, value) (XBARB_WR_SEL5_SEL11(base, value))
/*@}*/

/*******************************************************************************
 * XBARB_SEL6 - Crossbar B Select Register 6
 ******************************************************************************/

/*!
 * @brief XBARB_SEL6 - Crossbar B Select Register 6 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL6 register
 */
/*@{*/
#define XBARB_RD_SEL6(base)      (XBARB_SEL6_REG(base))
#define XBARB_WR_SEL6(base, value) (XBARB_SEL6_REG(base) = (value))
#define XBARB_RMW_SEL6(base, mask, value) (XBARB_WR_SEL6(base, (XBARB_RD_SEL6(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL6(base, value) (XBARB_WR_SEL6(base, XBARB_RD_SEL6(base) |  (value)))
#define XBARB_CLR_SEL6(base, value) (XBARB_WR_SEL6(base, XBARB_RD_SEL6(base) & ~(value)))
#define XBARB_TOG_SEL6(base, value) (XBARB_WR_SEL6(base, XBARB_RD_SEL6(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL6 bitfields
 */

/*!
 * @name Register XBARB_SEL6, field SEL12[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT12 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL6_SEL12 field. */
#define XBARB_RD_SEL6_SEL12(base) ((XBARB_SEL6_REG(base) & XBARB_SEL6_SEL12_MASK) >> XBARB_SEL6_SEL12_SHIFT)
#define XBARB_BRD_SEL6_SEL12(base) (XBARB_RD_SEL6_SEL12(base))

/*! @brief Set the SEL12 field to a new value. */
#define XBARB_WR_SEL6_SEL12(base, value) (XBARB_RMW_SEL6(base, XBARB_SEL6_SEL12_MASK, XBARB_SEL6_SEL12(value)))
#define XBARB_BWR_SEL6_SEL12(base, value) (XBARB_WR_SEL6_SEL12(base, value))
/*@}*/

/*!
 * @name Register XBARB_SEL6, field SEL13[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT13 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL6_SEL13 field. */
#define XBARB_RD_SEL6_SEL13(base) ((XBARB_SEL6_REG(base) & XBARB_SEL6_SEL13_MASK) >> XBARB_SEL6_SEL13_SHIFT)
#define XBARB_BRD_SEL6_SEL13(base) (XBARB_RD_SEL6_SEL13(base))

/*! @brief Set the SEL13 field to a new value. */
#define XBARB_WR_SEL6_SEL13(base, value) (XBARB_RMW_SEL6(base, XBARB_SEL6_SEL13_MASK, XBARB_SEL6_SEL13(value)))
#define XBARB_BWR_SEL6_SEL13(base, value) (XBARB_WR_SEL6_SEL13(base, value))
/*@}*/

/*******************************************************************************
 * XBARB_SEL7 - Crossbar B Select Register 7
 ******************************************************************************/

/*!
 * @brief XBARB_SEL7 - Crossbar B Select Register 7 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL7 register
 */
/*@{*/
#define XBARB_RD_SEL7(base)      (XBARB_SEL7_REG(base))
#define XBARB_WR_SEL7(base, value) (XBARB_SEL7_REG(base) = (value))
#define XBARB_RMW_SEL7(base, mask, value) (XBARB_WR_SEL7(base, (XBARB_RD_SEL7(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL7(base, value) (XBARB_WR_SEL7(base, XBARB_RD_SEL7(base) |  (value)))
#define XBARB_CLR_SEL7(base, value) (XBARB_WR_SEL7(base, XBARB_RD_SEL7(base) & ~(value)))
#define XBARB_TOG_SEL7(base, value) (XBARB_WR_SEL7(base, XBARB_RD_SEL7(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL7 bitfields
 */

/*!
 * @name Register XBARB_SEL7, field SEL14[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT14 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL7_SEL14 field. */
#define XBARB_RD_SEL7_SEL14(base) ((XBARB_SEL7_REG(base) & XBARB_SEL7_SEL14_MASK) >> XBARB_SEL7_SEL14_SHIFT)
#define XBARB_BRD_SEL7_SEL14(base) (XBARB_RD_SEL7_SEL14(base))

/*! @brief Set the SEL14 field to a new value. */
#define XBARB_WR_SEL7_SEL14(base, value) (XBARB_RMW_SEL7(base, XBARB_SEL7_SEL14_MASK, XBARB_SEL7_SEL14(value)))
#define XBARB_BWR_SEL7_SEL14(base, value) (XBARB_WR_SEL7_SEL14(base, value))
/*@}*/

/*!
 * @name Register XBARB_SEL7, field SEL15[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT15 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL7_SEL15 field. */
#define XBARB_RD_SEL7_SEL15(base) ((XBARB_SEL7_REG(base) & XBARB_SEL7_SEL15_MASK) >> XBARB_SEL7_SEL15_SHIFT)
#define XBARB_BRD_SEL7_SEL15(base) (XBARB_RD_SEL7_SEL15(base))

/*! @brief Set the SEL15 field to a new value. */
#define XBARB_WR_SEL7_SEL15(base, value) (XBARB_RMW_SEL7(base, XBARB_SEL7_SEL15_MASK, XBARB_SEL7_SEL15(value)))
#define XBARB_BWR_SEL7_SEL15(base, value) (XBARB_WR_SEL7_SEL15(base, value))
/*@}*/

/* Macros for entire XBARB_SELx register. */
#define XBARB_SELx(base, outIndex, input)         (*(volatile uint16_t *)((uintptr_t)&XBARA_SEL0_REG(base) + ((outIndex) / 2U) * 2U))

/* Set the SELx field to a new value. */
#define XBARB_WR_SELx_SELx(base, outIndex, input) (XBARB_SELx((base), (outIndex), (input)) = ((XBARB_SELx((base), (outIndex), (input)) & ~(0xFFU << (XBARB_SEL0_SEL1_SHIFT * ((outIndex) % 2U)))) | ((input) << (XBARB_SEL0_SEL1_SHIFT * ((outIndex) % 2U)))))

/* Read current value of the XBARB_SELx_SELx field. */
#define XBARB_RD_SELx_SELx(base, outIndex)        ((XBARB_SELx((base), (outIndex), (input)) >> XBARB_SEL0_SEL1_SHIFT * ((outIndex) % 2)) & 0xFFU)

/* Instance numbers for core modules */
#define JTAG_IDX (0) /*!< Instance number for JTAG. */
#define TPIU_IDX (0) /*!< Instance number for TPIU. */
#define SCB_IDX (0) /*!< Instance number for SCB. */
#define SWD_IDX (0) /*!< Instance number for SWD. */
#define CoreDebug_IDX (0) /*!< Instance number for CoreDebug. */

#endif /* __MKV45F15_EXTENSION_H__ */
/* EOF */
